<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>CoderDojo Heidelberg</title>
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
<meta name="robots" content="index,follow">
<meta name="keywords" lang="de" content="CoderDojo Heidelberg: Kinder und Jugendliche lernen Programmieren mit Spa&szlig;">
<meta name="description" content="Webseite der Organisation CoderDojo Heidelberg">
<link rel="stylesheet" type="text/css" href="css/style.css">
<link rel="shortcut icon" href="/favicon.ico">
<link rel="icon" type="image/png" href="/favicon.png">
<meta name="msapplication-TileColor" content="#ffffff">
<meta name="msapplication-TileImage" content="/mstile-144x144.png">
</head>
<body>
<!-- Beginn Header Logo -->
<div id="logo">
  <div id="logo_in">
  <img src="img/CoderDojoHeidelberg.jpg" height="300px">
  <!--
  <img align="right" src="img/CoderDojoHD.png" height="300px"> -->
  </div>
</div>
<!-- Ende Header Logo -->

<!-- Beginn des Rahmens der horizontalen Navigation -->
<div id="navi_rahmen">
<!-- Beginn der horizontalen Navigation -->
<div align="right">
<table id="navi_oben" cellpadding="0" cellspacing="0">
  <tr>
    <td><a href="index.html">Home</a></td>
    <td><a href="Mentoren.htm">Mentoren</a></td>
    <td><a href="Termine.htm">Termine</a></td>
    <td><a href="Links.htm">Links</a></td>
	<td><a href="Kontakt.htm">Kontakt</a></td>
  </tr>
</table>
</div>
<!-- Ende der horizontalen Navigation -->
</div>
<!-- Ende des Rahmens der horizontalen Navigation -->
<table id="abs" cellpadding="0" cellspacing="0">
  <tr>
<!-- Beginn vertikales Navigationsmen&uuml; -->
<!-- 
 <td id="navi_li_rahmen" valign="top">
<table cellpadding="0" cellspacing="1">
  <tr>
    <td cla&szlig;="navi_li">
<div cla&szlig;="navi_ue">Submen&uuml; 1</div>
<a href="index.htm">Anreise</a>
<a href="#">Infos</a>
<a href="#">Katalog</a>
<a href="#">Partner</a>
<a href="#">Bestellung</a>
<a href="#">Newsletter</a>
    </td></tr>
    <tr>
    <td cla&szlig;="navi_li_2">
<div cla&szlig;="navi_ue">Submen&uuml; 2</div>
<a href="index.htm">Allgemeines</a>
<a href="#">Forum</a>
<a href="#">E-Mail</a>
<a href="#">AGB</a>
<a href="#">Datenschutz</a>
<a href="#">Impre&szlig;um</a>
    </td>
  </tr>
  <tr>
    <td cla&szlig;="navi_li_3">
<div cla&szlig;="navi_ue">Submen&uuml; 3</div>
<a href="index.htm">Spiele</a>
<a href="#">Downloads</a>
<a href="#">Wetter</a>
<a href="#">Werbung</a>
<a href="#">Anmeldung</a>
<a href="#">Termine</a>
    </td>
  </tr>
</table>
    </td>-->
<!-- Ende vertikales Navigationsmen&uuml; -->

    <td id="inhalt" valign="top">
<!-- ab hier beginnt der Inhalt -->

<h1>Herzlich willkommen auf der Webseite des CoderDojo Heidelberg</h1>
<p>Hier findet ihr aktuelle Informationen zu unseren Treffen.

<h2>Was ist ein CoderDojo?</h2>
<p>CoderDojo ist eine weltweit verbreitete, gemeinn&uuml;tzige Organisation, deren Ziel es ist, Kindern und Jugendlichen Computer, Technik und Programmieren n&auml;herzubringen. Die offizielle Adre&szlig;e der CoderDojo-Organisation (Weltweit) finden Sie unter "Links".</p>

<h2>Warum CoderDojo?</h2>
<p>Das CoderDojo ist eine M&ouml;glichkeit f&uuml;r M&auml;dchen und Jungen im Alter zwischen 10 und 17 Jahren Programmieren zu lernen und sich kreativ mit dem Computer auseinander zu setzen. Freiwillige Mentoren helfen bei der Programmierung. Der Rahmen ist frei - die Kinder k&ouml;nnen sich in der Gruppe oder allein mit Hardware- und Softwareprogrammierung besch&auml;ftigen. Tutorials und Online-Kurse sowie Programmier-R&auml;tsel stehen zur Auswahl bereit.</p>

<p>In regelm&auml;&szlig;igen Programmierclubs wollen wir intere&szlig;ierten Kindern und Jugendlichen den Spa&szlig; am Programmieren vermitteln. 
Dabei lernen sie, da&szlig; sie den Computer kreativ nutzen k&ouml;nnen, um damit eigene Ideen umzusetzen.

<p>Ziel ist nicht das Erlernen einer bestimmten Programmiersprache, sondern die prinzipiellen Konzepte hinter der Programmierung von Computern.

<h2>Wie funktioniert CoderDojo Heidelberg?</h2>
<p>Unsere Treffen finden ab Januar 2018 alle vier Wochen statt. Die teilnehmende Kinder und Jugendlichen werden von Studenten und Mentoren aus unterschiedlichen technischen Bereichen betreut, w&auml;hrend sie programmieren und unter kompetenter Anleitung ihre F&auml;higkeiten entwickeln und ausbauen. 

<p>Aus logistischen Gr&uuml;nden sind die verf&uuml;gbaren Pl&auml;tze begrenzt; f&uuml;r regelm&auml;&szlig;ige Teilnehmer gilt, wer sich zuerst anmeldet bekommt einen Platz. Die Anzahl der Pl&auml;tze h&auml;ngt vor allem davon ab, wie viele Mentoren zur Verf&uuml;gung stehen.
</p>

<h2>Welche Vorau&szlig;etzungen soll ein Kind oder Jugendliche mitbringen?</h2>
<p>Vor allem Neugierde und Begeisterung f&uuml;r die Arbeit mit einem Computer. Die Teilnehmer bringen im idealen Fall ihren einen eigenen Laptop mit. Sollte dies nicht m&ouml;glich sein, so bitten wir Sie um entsprechende Nachricht bei der Anmeldung. Smartphones, Tablets und iPads sind allerdings nicht zum Programmieren geeignet.

<p>Achtung! Wir bieten das CoderDojo f&uuml;r Kinder und Jugendliche zwischen 10 und 17 Jahren an. F&uuml;r Kinder unter 13 Jahren allerding ist die Begleitung eines Erwachsenen notwendig.

<h2>Ist CoderDojo das Richtige f&uuml;r mein Kind?</h2>
	<p>Am einfachsten l&auml;&szlig;t sich das herausfinden, indem Sie das mit Ihrem Kind einfach mal ausprobieren! Wir erheben keine Teilnehmergeb&uuml;hr und wenn Ihr Kind Spa&szlig; bei uns hat, dann freuen wir uns, es wieder bei uns zu begr&uuml;&szlig;en!</p>

<h2>Kann mein Kind jederzeit dazu kommen, oder mu&szlig; ich bis zum n&auml;chsten Durchgang warten?</h2>
	<p>Der Einstieg ist nur einmal im Monat m&ouml;glich. Die entsprechenden Dojo sind in den aufgef&uuml;hrten Terminen markiert.</p>

<h2>Mu&szlig; mein Kind schon programmieren k&ouml;nnen?</h2>
	<p>Nein. Gerade das soll Ihr Kind ja bei uns lernen! Wir wollen ein Umfeld bieten, in dem intere&szlig;ierte Kinder und Jugendliche gemeinsam etwas ausprobieren. Wir, die Mentoren, helfen weiter, wenn es zu knifflig wird. Falls Ihr Kind schon programmieren kann, begleiten wir gerne die Schritte zu komplexeren Projekten.</p>

<h2>Was mu&szlig; mein Kind sonst k&ouml;nnen?</h2>
	<p>Ihr Kind sollte den grundlegenden Umgang mit Computern beherschen. Es sollte z.B. selbst&auml;ndig neue Dateien und Ordner erstellen und eine Suchanfrage im Internet durchf&uuml;hren k&ouml;nnen.</p>

<h2>Was mu&szlig; mein Kind mitbringen?</h2>
	<p>Es w&auml;re super, wenn Ihr Kind einen Laptop mitbringen k&ouml;nnte. Wenn das nicht m&ouml;glich ist, sagen Sie uns  bitte bei der Anmeldung unbedingt Bescheid - wir versuchen dann ein Laptop zur Verf&uuml;gung zu stellen.</p>

<h2>Was f&uuml;r eine Art Laptop braucht mein Kind?</h2>
	<p> Das Laptop mu&szlig; nicht neu oder besonders schnell sein. Smartphones, Android-Tablets oder iPads sind allerdings nicht zum Programmieren geeignet. Wir empfehlen ausdr&uuml;cklich eine Versicherung f&uuml;r den Laptop abzuschlie&szlig;en, um auf der sicherer Seite zu sein.</p>

<h2>Anmeldegeb&uuml;hren</h2>
<p>CoderDojo ist eine "no profit" Organisation. Geb&uuml;hren fallen nicht an, weder f&uuml;r die Anmeldung noch f&uuml;r die Teilnahme. 
Wir sind jedoch bei den Treffen sehr dankbar f&uuml;r Spenden von Kuchen, Kaffee, Tee, Wa&szlig;er, etc. Die Organisation wird nach und nach eine Doodle-Liste organisieren.



<h2>Wer steckt hinter CoderDojo Heidelberg?</h2>
<p>Wir von der CoderDojo-Gruppe Heidelberg wollen solche Programmierclubs in Heidelberg etablieren.

<p>Das Team besteht zur Zeit aus mehreren Personen, die &uuml;berwiegend beruflich mit Softwareentwicklung zu tun haben. Ansprechpartner ist Manuela Notarbartolo.

<h2>N&auml;chste Veranstaltungen</h2>
<p>Das n&auml;chste CoderDojo findet am

<h3>Sonntag, den 28. Januar 2018 <br>
von 10 - 13 Uhr </h3>
<p>statt. Eine <a href="Termine.htm" target="_blank">Anmeldung</a> ist kostenfrei aber erforderlich.
<p><a href="Termine.htm" target"_self">Hier geht es zu den anderen Termine</a>

<h2>Wir suchen Mentoren</h2>
<p>Die Anzahl der Teilnehmer(innen) wird &uuml;berwiegend durch die Anzahl der betreuenden Mentoren vor Ort beschr&auml;nkt. Falls Sie gerne - ab und an oder regelm&auml;&szlig;ig - als Mentor mitmachen m&ouml;chten, lesen Sie hier wie Sie <a href="Mentoren.htm">Mentor werden</a> k&ouml;nnen.



<!-- Ende des Inhalts -->
</td>
  </tr>
</table>
<!-- Beginn Tabelle der Fu&szlig;zeile -->
<div id="footer">
CoderDojo Heidelberg - <a href="https://www.hpc-schulen.de/" target="_blank">@FUU Privatschule Heidelberg</a> | <a href="Datenschutz.htm" target="_self">Datenschutz</a> | <a href="Impre&szlig;um.htm" target="_self">Impre&szlig;um</a>

<!-- Ende des Backlink-Codes -->
</div>
<!-- Ende Tabelle der Fu&szlig;zeile -->
</body>
</html>